### TOP 50 SKUS

In this section, I am going to analyze which are the references most sold in the last 6 months (from 1 october 2018 to 31 march 2019).

First of all, we set as path the directory which contains the data

In [10]:
import os

path = '/home/miguel/Escritorio/TFM'
os.chdir(path)

In [11]:
pwd

'/home/miguel/Escritorio/TFM'

Secondly, I import the libraries that I am going to work in this script

In [12]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

After that, I load xlsx file with the required data:
    - References
    - Name References
    - Date time 
    - Net incomes
    - Units sold per transaction

In [13]:
df_bw = pd.read_excel('BW.xlsx', sheet_name="BW")

In [14]:
df_bw.head(5)

,Referencia,Name,T Día natural,Valor neto pedidos,Cantidad en unidades (pedidos)
0,4623,"ESPEJO PUERTA ""LCC"" BLANCO POLIETILENO",11.09.2017,18.93,1
1,4623,"ESPEJO PUERTA ""LCC"" BLANCO POLIETILENO",21.09.2017,18.93,1
2,4623,"ESPEJO PUERTA ""LCC"" BLANCO POLIETILENO",08.10.2017,16.08,1
3,4623,"ESPEJO PUERTA ""LCC"" BLANCO POLIETILENO",16.10.2017,16.08,1
4,4623,"ESPEJO PUERTA ""LCC"" BLANCO POLIETILENO",21.10.2017,16.08,1

I also check the shape and info of this data

In [15]:
df_bw.shape

(37614, 5)

In [16]:
df_bw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37614 entries, 0 to 37613
Data columns (total 5 columns):
Referencia                        37614 non-null int64
Name                              37614 non-null object
T Día natural                     37614 non-null object
Valor neto pedidos                37614 non-null float64
Cantidad en unidades (pedidos)    37614 non-null int64
dtypes: float64(1), int64(2), object(2)
memory usage: 1.4+ MB

It is all right.

Then, I continue renaming the columns with the purpose of removing black spaces

In [17]:
df_bw = df_bw.rename(index=str, columns={"Referencia":"Reference", "T Día natural":"Date", "Valor neto pedidos":"Net_Incomes", "Cantidad en unidades (pedidos)":"Units_sold"})

In [18]:
df_bw.head(5)

,Reference,Name,Date,Net_Incomes,Units_sold
0,4623,"ESPEJO PUERTA ""LCC"" BLANCO POLIETILENO",11.09.2017,18.93,1
1,4623,"ESPEJO PUERTA ""LCC"" BLANCO POLIETILENO",21.09.2017,18.93,1
2,4623,"ESPEJO PUERTA ""LCC"" BLANCO POLIETILENO",08.10.2017,16.08,1
3,4623,"ESPEJO PUERTA ""LCC"" BLANCO POLIETILENO",16.10.2017,16.08,1
4,4623,"ESPEJO PUERTA ""LCC"" BLANCO POLIETILENO",21.10.2017,16.08,1

Now, I filter the transactions from 1 october 2018 to 31 march 2019.

To develop correctly this filter, it is necessary to change "Date" column from object type to datetime

In [19]:
from datetime import datetime

In [20]:
df_bw["Date"] = pd.to_datetime(df_bw["Date"], format = '%d.%m.%Y')

In [29]:
df_bw_filter = df_bw[df_bw["Date"]>"10.01.2018"]

In [30]:
df_bw_filter.head(5)

    Reference                      Name       Date  Net_Incomes  Units_sold
33       6558  JARRÓN CILÍNDRICO VIDRIO 2018-12-09        13.97           1
37       6565      JARRÓN ESFERA VIDRIO 2018-11-08        11.08           1
38       6565      JARRÓN ESFERA VIDRIO 2018-11-23        22.14           2
39       6565      JARRÓN ESFERA VIDRIO 2019-02-04        14.90           1
40       6565      JARRÓN ESFERA VIDRIO 2019-03-12        12.31           1

In [31]:
df_bw_filter.shape

(15032, 5)

Once I have obtained the selected data, I group by Reference and I enumerate how many days each reference has been sold during that period in order to be able to find the most sold products with high frequency.

In [53]:
df_bw_groupby = df_bw.groupby(by="Reference").agg({"Date":"count", "Units_sold":"sum","Net_Incomes":"sum"}).sort_values(by='Units_sold',ascending=False)
df_bw_groupby.head(5)

           Date  Units_sold  Net_Incomes
Reference
265400       82        1092          0.0
265600       82        1092          0.0
251900       82         904          0.0
10040        58         562          0.0
10048        48         506          0.0

In [46]:
df_bw_groupby.describe()

              Date   Units_sold   Net_Incomes
count  8477.000000  8477.000000   8477.000000
mean      4.286422     5.971334    260.089599
std       7.488394    13.186183    699.587363
min       1.000000     1.000000      2.150000
25%       1.000000     1.000000     32.930000
50%       2.000000     3.000000     78.350000
75%       4.000000     6.000000    218.600000
max     172.000000   416.000000  14050.750000

After grouping and checking the new dataframe, I should select the most suitable references for this study following these steps:
   - Net_Incomes > 0€ in BW
   - At least more than 30 transactaions
   - At least more than 30 days of exposition in Adwords
   - Cost > 0€ in Adwords

In [ ]:
df_bw_groupby = df_bw_groupby[ df_bw_groupby["Net_Incomes"]!=0]

In [ ]:
df_bw_groupby[ df_bw_groupby["Date"]>30].head(30)